
IDENTIFICATION DIVISION.
Program-ID. Prog01.
Author. H. Mortensen.
*
ENVIRONMENT DIVISION.
Configuration Section.
Source-Computer. PDP-10.
Object-Computer. PDP-10.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT SALES-FILE        ASSIGN TO DSK    RECORDING MODE IS ASCII.
   SELECT CURRENT-FILE      ASSIGN TO DSK    RECORDING MODE IS ASCII.
   SELECT OLDMAS-FILE       ASSIGN TO DSK    RECORDING MODE IS ASCII.
   SELECT OUTPUT-LINE       ASSIGN TO DSK    RECORDING MODE IS ASCII.

DATA DIVISION.
FILE SECTION.
FD  SALES-FILE    LABEL RECORDS ARE STANDARD
		  VALUE OF IDENTIFICATION IS "SLSPRS   "
		  DATA RECORD IS SALES-REC.
01  SALES-REC.
   05  SLS-REGION         PIC XX.
   05  SLS-NUMBER         PIC X(4).
   05  SLS-NAME           PIC X(18).
   05  QUOTA-CLASS        PIC X.
   05  COMM-CLASS         PIC X.
   05  Y-T-D-SALES        PIC 9(06)V99.
   05  Y-T-D-RETURNS      PIC 9(05)V99.
   05  CURRENT-YEAR       PIC X(2).
   05  filler             PIC X(37).
*
FD  CURRENT-FILE           LABEL RECORDS ARE STANDARD
			  VALUE OF IDENTIFICATION IS "CURSLS   "
			  DATA RECORD IS CURR-REC.
01  CURR-REC.
   05  CR-SLS-NUMBER      PIC X(4).
   05  CURR-MO-SALES      PIC 9(05)V99.
   05  CURR-MO-RETURNS    PIC 9(04)V99.
   05  filler             PIC X(35).
*
FD  OLDMAS-FILE           LABEL RECORDS ARE STANDARD
                          VALUE OF IDENTIFICATION IS "OLDMAS   "
                          DATA RECORD IS OLD-REC.
01  OLD-REC.
   05  OLD-NUM            PIC X(04).
   05  OLD-NAME           PIC X(18).
   05  OLD-REGION         PIC XX.
   05  OLD-Q-CLASS        PIC X.
   05  OLD-C-CLASS        PIC X.
   05  OLD-CURR-YEAR      PIC XX.
   05  OLD-YTD-SALES      PIC 9(06)V99.
   05  OLD-YTD-RETURNS    PIC 9(05)V99.
   05  filler             PIC X(37).
*
FD  OUTPUT-LINE           LABEL RECORDS ARE STANDARD
                          VALUE OF IDENTIFICATION IS "FILE  OUT"
			  DATA RECORD IS OUTLINE.
01  OUTLINE.
   05  filler             PIC X(133).
*
WORKING-STORAGE SECTION.
01  U-M-HEADING.
   05  filler  PIC X(42)  VALUE SPACES.
   05  filler  PIC X(10)  VALUE "NEW MASTER".
   05  filler  PIC X(72)  VALUE SPACES.
01  U-M-COLUMN-HEAD-1.
   05  filler  PIC X(02)  VALUE SPACES.
   05  filler  PIC X(11)  VALUE "SALESPERSON".
   05  filler  PIC X(05)  VALUE SPACES.
   05  filler  PIC X(11)  VALUE "SALESPERSON".
   05  filler  PIC X(13)  VALUE SPACES.
   05  filler  PIC X(05)  VALUE "QUOTA".
   05  filler  PIC X(01)  VALUE SPACES.
   05  filler  PIC X(07)  VALUE "COMMISS".
   05  filler  PIC X(08)  VALUE " CURRENT".
   05  filler  PIC X(11)  VALUE "    YEAR TO".
   05  filler  PIC X(07)  VALUE SPACES.
   05  filler  PIC X(07)  VALUE "YEAR TO".
   05  filler  PIC X(46)  VALUE SPACES.

01  U-M-COLUMN-HEAD-2.
   05  filler  PIC X(04)  VALUE SPACES.
   05  filler  PIC X(06)  VALUE "NUMBER".
   05  filler  PIC X(10)  VALUE SPACES.
   05  filler  PIC X(04)  VALUE "NAME".
   05  filler  PIC X(10)  VALUE SPACES.
   05  filler  PIC X(06)  VALUE "REGION".
   05  filler  PIC X(07)  VALUE "  CLASS".
   05  filler  PIC X(07)  VALUE "  CLASS".
   05  filler  PIC X(07)  VALUE "   YEAR".
   05  filler  PIC X(05)  VALUE SPACES.
   05  filler  PIC X(10)  VALUE "DATE SALES".
   05  filler  PIC X(04)  VALUE SPACES.
   05  filler  PIC X(12)  VALUE "DATE RETURNS".
   05  filler  PIC X(42)  VALUE SPACES.
01  U-M-DETAIL-LINE.
   05  filler  PIC X(04)  VALUE SPACES.
   05  SLS-NUM-OUT     PIC X(04).
   05  filler  PIC X(07)  VALUE SPACES.
   05  SLS-NAME-OUT    PIC X(18).
   05  filler  PIC X(03)  VALUE SPACES.
   05  REGION-OUT      PIC XX.
   05  filler  PIC X(06)  VALUE SPACES.
   05  Q-CLASS-OUT     PIC X.
   05  filler  PIC X(05)  VALUE SPACES.
   05  C-CLASS-OUT     PIC X.
   05  filler  PIC X(07)  VALUE SPACES.
   05  CURR-YEAR-OUT   PIC XX.
   05  filler  PIC X(06)  VALUE SPACES.
   05  YTD-SALES-OUT   PIC $ZZZ,ZZ9.99.
   05  filler  PIC X(03)  VALUE SPACES.
   05  YTD-RETURNS-OUT PIC $ZZ,ZZ9.99.
   05  filler  PIC X(43)  VALUE SPACES.
01  FIRST-E-REP-HEADING-1.
   05  filler  PIC X(01)  VALUE SPACES.
   05  filler  PIC X(31)  VALUE
       "THE FOLLOWING SALESMEN HAVE THE".
   05  filler  PIC X(101)  VALUE SPACES.
01  FIRST-E-REP-HEADING-2.
   05  filler  PIC X(02)  VALUE SPACES.
   05  filler  PIC X(39)  VALUE
       "WRONG COMMISSION CLASS FOR QUOTA CLASS:".
   05  filler  PIC X(93)  VALUE SPACES.
01  FIRST-E-REP-COLUMN-HEAD.
   05  filler  PIC X(09)  VALUE SPACES.
   05  filler  PIC X(04)  VALUE "NAME".
   05  filler  PIC X(08)  VALUE SPACES.
   05  filler  PIC X(09)  VALUE "NUMBER   ".
   05  filler  PIC X(14)  VALUE "QUOTA CLASS   ".
   05  filler  PIC X(11)  VALUE "COMM. CLASS".
   05  filler  PIC X(78)  VALUE SPACES.
01  FIRST-E-REP-DETAIL-LINE.
   05  filler  PIC X(02)  VALUE SPACES.
   05  FIRST-E-REP-NAME   PIC X(18).
   05  filler  PIC X(03)  VALUE SPACES.
   05  FIRST-E-REP-NUM    PIC X(04).
   05  filler  PIC X(04)  VALUE SPACES.
   05  FIRST-E-REP-Q-C    PIC X.
   05  filler  PIC X(13)  VALUE SPACES.
   05  FIRST-E-REP-C-C    PIC X.
   05  filler  PIC X(84)  VALUE SPACES.
01  ERROR-CONTROL-HEADING.
   05  filler  PIC X(20).
   05  filler  PIC X(20)  VALUE
       "ERROR/CONTROL REPORT".
   05  filler  PIC X(94)  VALUE SPACES.
01  ERROR-CONTROL-DETAIL.
   05  filler  PIC X(06)  VALUE SPACES.
   05  filler  PIC X(12)  VALUE "SALESPERSON ".
   05  E-C-NUM-OUT        PIC X(04).
   05  filler  PIC X(34)  VALUE
       "  - UNMATCHED CURRENT SALES RECORD".
   05  filler  PIC X(78)  VALUE SPACES.
01  E-C-TOT-1.
   05  filler  PIC X(06)  VALUE SPACES.
   05  MATCHES-OUT        PIC ZZ9.
   05  filler  PIC X(37)  VALUE
         "   MATCHING CURRENT/YTD SALES RECORDS".
   05  filler  PIC X(88)  VALUE SPACES.
01  E-C-TOT-2.
   05  filler  PIC X(06)  VALUE SPACES.
   05  UNMATCHED-YTD-OUT  PIC ZZ9.
   05  filler  PIC X(30)  VALUE
       "   UNMATCHED YTD SALES RECORDS".
   05  filler  PIC X(95)  VALUE SPACES.
01  E-C-TOT-3.
   05  filler  PIC X(06)  VALUE SPACES.
   05  UNMATCHED-CURR-OUT PIC ZZ9.
   05  filler  PIC X(35)  VALUE
       "    UNMATCHED CURRENT SALES RECORDS".
   05  filler  PIC X(91)  VALUE SPACES.
01  WORK-AREA.
   05  O-EOF              PIC X  VALUE "N".
   05  C-EOF              PIC X  VALUE "N".
   05  EOF                PIC X  VALUE "N".
   05  ERR-NUM            PIC X(04)  OCCURS 25 TIMES.
   05  SUB                PIC 9(02).
   05  WS-NET-SALES       PIC 9(09)V99.
   05  WS-MATCHES         PIC 9(03)  VALUE ZEROS.
   05  WS-UNMATCHED-YTD   PIC 9(03)  VALUE ZEROS.
   05  WS-UNMATCHED-CURR  PIC 9(03)  VALUE ZEROS.
*
PROCEDURE DIVISION.
001-MAIN.
   PERFORM 100-INIT.
   PERFORM 200-CREATE UNTIL EOF = "Y".
   PERFORM 300-RE-INIT.
   PERFORM 400-RE-CREATE UNTIL O-EOF = "Y" OR C-EOF = "Y".
   PERFORM 500-WRAP.
   PERFORM 900-TERMINATE.
   STOP RUN.
100-INIT.
   OPEN INPUT SALES-FILE.
   OPEN OUTPUT OUTPUT-LINE.
   OPEN OUTPUT OLDMAS-FILE.
   MOVE FIRST-E-REP-HEADING-1 TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 5 LINES.
   MOVE FIRST-E-REP-HEADING-2 TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
   MOVE SPACES TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
   PERFORM 150-READ-SALES-FILE.
150-READ-SALES-FILE.
   READ SALES-FILE
       AT END MOVE  "Y" TO EOF.
200-CREATE.
   IF QUOTA-CLASS = "A"
       IF COMM-CLASS = 5 OR 6
	   PERFORM 210-WRITE-OLD
       ELSE
	   PERFORM 220-WRITE-ERROR
   ELSE
       PERFORM 210-WRITE-OLD.
   PERFORM 150-READ-SALES-FILE.
210-WRITE-OLD.
   MOVE SLS-REGION TO OLD-REGION.
   MOVE SLS-NUMBER TO OLD-NUM.
   MOVE SLS-NAME TO OLD-NAME.
   MOVE QUOTA-CLASS TO OLD-Q-CLASS.
   MOVE COMM-CLASS TO OLD-C-CLASS.
   MOVE Y-T-D-SALES TO OLD-YTD-SALES.
   MOVE Y-T-D-RETURNS TO OLD-YTD-RETURNS.
   MOVE CURRENT-YEAR TO OLD-CURR-YEAR.
   WRITE OLD-REC.
220-WRITE-ERROR.
   MOVE SLS-NAME TO FIRST-E-REP-NAME.
   MOVE SLS-NUMBER TO FIRST-E-REP-NUM.
   MOVE QUOTA-CLASS TO FIRST-E-REP-Q-C.
   MOVE COMM-CLASS TO FIRST-E-REP-C-C.
   MOVE FIRST-E-REP-DETAIL-LINE TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
300-RE-INIT.
   CLOSE SALES-FILE.
   CLOSE OLDMAS-FILE.
   PERFORM 310-INIT-ARRAY
       VARYING SUB FROM 1 BY 1
       UNTIL SUB > 25.
   MOVE ZEROS TO SUB.

   OPEN INPUT OLDMAS-FILE.
   OPEN INPUT CURRENT-FILE.
   PERFORM 320-READ-CURRENT-FILE.
   PERFORM 330-READ-OLDMAS-FILE.
   PERFORM 340-FINAL-REP-HEADING.
310-INIT-ARRAY.
   MOVE 9999 TO ERR-NUM(SUB).
320-READ-CURRENT-FILE.
   READ CURRENT-FILE
       AT END MOVE "Y" TO C-EOF.
330-READ-OLDMAS-FILE.
   READ OLDMAS-FILE
       AT END MOVE "Y" TO O-EOF.
340-FINAL-REP-HEADING.
   MOVE U-M-HEADING TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 5 LINES.
   MOVE SPACES TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
   MOVE U-M-COLUMN-HEAD-1 TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
   MOVE U-M-COLUMN-HEAD-2 TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
   MOVE SPACES TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
400-RE-CREATE.
   IF CR-SLS-NUMBER = OLD-NUM
       PERFORM 700-UPDATE
   ELSE
       IF CR-SLS-NUMBER > OLD-NUM
	   PERFORM 720-UNMATCHED-MASTER
       ELSE
	   PERFORM 730-UNMATCHED-TRANSACTION.
   PERFORM 320-READ-CURRENT-FILE.
   PERFORM 330-READ-OLDMAS-FILE.
700-UPDATE.
   MOVE OLD-NUM TO SLS-NUM-OUT.
   MOVE OLD-NAME TO SLS-NAME-OUT.
   MOVE OLD-REGION TO REGION-OUT.
   MOVE OLD-Q-CLASS TO Q-CLASS-OUT.
   MOVE OLD-C-CLASS TO C-CLASS-OUT.
   MOVE OLD-CURR-YEAR TO CURR-YEAR-OUT.
   MOVE OLD-YTD-SALES TO YTD-SALES-OUT.
   MOVE OLD-YTD-RETURNS TO YTD-RETURNS-OUT.
   MOVE U-M-DETAIL-LINE TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 1 LINE.
   ADD 1 TO WS-MATCHES.
720-UNMATCHED-MASTER.
   ADD 1 TO WS-UNMATCHED-YTD.
730-UNMATCHED-TRANSACTION.
   ADD 1 TO WS-UNMATCHED-CURR.
   ADD 1 TO SUB.
   MOVE OLD-NUM TO ERR-NUM(SUB).
500-WRAP.
   IF O-EOF = "Y"
       PERFORM 510-WRAP-CURRENT-FILE UNTIL C-EOF = "Y"
   ELSE
       PERFORM 520-WRAP-OLDMAS-FILE UNTIL O-EOF = "Y".
510-WRAP-CURRENT-FILE.
   ADD 1 TO SUB.
   ADD 1 TO WS-UNMATCHED-CURR.
   MOVE OLD-NUM TO ERR-NUM(SUB).
   READ CURRENT-FILE
      AT END MOVE "Y" TO C-EOF.
520-WRAP-OLDMAS-FILE.
   ADD 1 TO WS-UNMATCHED-YTD.
   READ OLDMAS-FILE
      AT END MOVE "Y" TO O-EOF.
900-TERMINATE.
   CLOSE CURRENT-FILE.
   CLOSE OLDMAS-FILE.
   MOVE ERROR-CONTROL-HEADING TO OUTLINE.
   WRITE OUTLINE
       AFTER ADVANCING 5 LINES.
   MOVE 1 TO SUB.
   PERFORM 910-WRITE-CONTROL
       UNTIL ERR-NUM(SUB) = 9999.
   CLOSE OUTPUT-LINE.
910-WRITE-CONTROL.
   IF ERR-NUM(SUB) = 9999
       NEXT SENTENCE
   ELSE
       MOVE ERR-NUM(SUB) TO E-C-NUM-OUT
       MOVE ERROR-CONTROL-DETAIL TO OUTLINE
       ADD 1 TO SUB.

    